"**Last updated:** [16/10/2025]\n\n## 1. Who we are\n\nThis website (“Site”) is operated by Returns Null.\nIt is hosted on **Vercel, Inc.** infrastructure.\nIf you have any questions about this policy, please contact us.\n\n**Email:** [support@returnsnull.dev](mailto:support@returnsnull.dev)\n\n## 2. What information we collect\n\nWe do not collect personal information directly.\nHowever, when you visit our Site, certain data is automatically collected by third-party services we use:\n\n* **Google Analytics** – gathers anonymized statistics about visitor behavior (pages visited, time spent, referrer, browser type, approximate location).\n* **Google AdSense** – displays ads and may collect data to personalize and measure ad performance.\n* **Google Tag Manager** – manages the tags and scripts of these services.\n\nThese tools may collect:\n\n* IP addresses (which can be anonymized)\n* Device and browser information\n* Interaction data (clicks, page views, scrolls, etc.)\n* Cookies and similar technologies for analytics and ad personalization\n\nFor details on how Google handles this data, see:\n[https://policies.google.com/technologies/partner-sites](https://policies.google.com/technologies/partner-sites)\n\n## 3. Why we collect data\n\nThe data collected through Google’s services is used solely to:\n\n* Analyze traffic and improve site performance (Analytics)\n* Serve ads and measure their effectiveness (AdSense)\n* Manage tracking scripts (Tag Manager)\n\nWe do not sell, rent, or share your personal information with any third parties beyond these service providers.\n\n## 4. Legal basis for processing\n\nIf you are located in the European Economic Area (EEA) or the UK, the processing of your data is based on:\n\n* **Consent** – for analytics and advertising cookies, obtained through our cookie banner.\n* **Legitimate interest** – for essential cookies required for the site’s basic operation.\n\nYou can withdraw consent at any time by updating your cookie preferences or clearing cookies in your browser.\n\n## 5. Data retention\n\nWe do not store personal data on our servers.\nData collected via Google Analytics is retained according to your configured settings in Google Analytics (default: 14 months or less).\n\n## 6. Your rights\n\nDepending on your location, you may have rights to:\n\n* Access, correct, or delete your data.\n* Withdraw consent.\n* Object to certain data uses.\n  To exercise these rights, please contact us at [support@returnsnull.dev](mailto:support@returnsnull.dev).\n\nUsers can also:\n\n* Opt out of Analytics tracking using the [Google Analytics Opt-Out Add-On](https://tools.google.com/dlpage/gaoptout).\n* Manage ad personalization at [https://adssettings.google.com/](https://adssettings.google.com/).\n\n## 7. Data sharing and transfers\n\nData collected by Google may be processed on servers located outside your country.\nGoogle is certified under the EU-US Data Privacy Framework for data transfers.\n\n## 8. Hosting\n\nOur Site is hosted by **Vercel, Inc.**, which may log IP addresses and basic request information for operational and security purposes. These logs are not used for tracking or marketing.\n\n## 9. Updates\n\nWe may update this Privacy Policy from time to time. Updates will be posted on this page with a revised “Last updated” date."